In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\utkarsh\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\utkarsh\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.4)

In [2]:
import mysql.connector as connection

In [3]:
connection.connect(host="localhost",user="root", passwd="Ineuron@ukc@5",use_pure=True)

In [4]:
connection.connect(host="localhost",user="root", passwd="Wrong password",use_pure=True)

ProgrammingError: 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)

In [5]:
connection.connect(host="incorrect username",user="root", passwd="Ineuron@ukc@5",use_pure=True)

InterfaceError: 2003: Can't connect to MySQL server on '%-.100s:%u' (%s) (Warning: %u format: a number is required, not str)

##### since there is possibility to make mistakes while typing username and password typing, that is why we use exception handling for this purpose.

In [6]:
connection.connect(host="localhost",user="root", passwd="Ineuron@ukc@5",use_pure=True)

##### if we are able get an mySQL connection object in the console, it simply means that we are able to establish a connection fromy my jupyter notebook to my SQL workbench.

##### now, we will try to know what all DBs are already available under mySQL server

In [7]:
conn = connection.connect(host="localhost",user="root", passwd="Ineuron@ukc@5",use_pure=True)
# check if the connection is established
#here we have stored the established connection in an object called conn

In [8]:
cur = conn.cursor()
#create a cursor to execute queries
#with the help of connection, we are using cursor as here: conn.cursor()
#we are setting a cursor i.e. pointer ....to reach to particular index of DB contents
#by default pointer is set to very first index of whateve query we are going to execute

###### 
query = "show databases"

this is my query that will be executed

In [9]:
cur.execute("show databases")
# here we are executing the query with the help of cursor to show databases already available in mySQL server
#it is executing on whatever communication which we have established

In [10]:
type(cur.execute("show databases"))

InternalError: Unread result found

In [11]:
import mysql.connector as connection

In [12]:
conn = connection.connect(host="localhost",user="root", passwd="Ineuron@ukc@5",use_pure=True)

In [13]:
cur = conn.cursor()

In [14]:
type(cur.execute("show databases"))

NoneType

In [ ]:
import mysql.connector as connection

In [15]:
conn = connection.connect(host="localhost",user="root", passwd="Ineuron@ukc@5",use_pure=True)

In [16]:
cur = conn.cursor()

In [17]:
cur.execute("show databases")

#### we have to rewrite the same code because of cursor being set at last....that is why we were getting error

In [18]:
#### we will try to fetch data user has received
# output is list of tuples

cur.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

###### samethings will be shown in mySQL workbench on executing 'show databases' in query....just the format is different

In [19]:
import mysql.connector as connection

In [20]:
conn = connection.connect(host="localhost",user="root", passwd="Ineuron@ukc@5",use_pure=True)

In [21]:
cur = conn.cursor()

In [22]:
cur.execute("show databases")

In [23]:
res = cur.fetchall()

In [24]:
res

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [25]:
res[1]

('mysql',)

In [26]:
res[1][0]

'mysql'

In [27]:
for i in res:
    print(i[0])

information_schema
mysql
performance_schema
sakila
sys
world

In [28]:
import mysql.connector as connection

In [29]:
conn = connection.connect(host="localhost",user="root", passwd="Ineuron@ukc@5",use_pure=True)

In [30]:
cur = conn.cursor()

In [31]:
cur.execute("create database sudhanshu12345")

In [32]:
mydb = connection.connect(host="localhost", database = 'sudhanshu12345',user="root", passwd="Ineuron@ukc@5",use_pure=True)

In [33]:
mydb.is_connected()

True

In [34]:
cur = mydb.cursor()

In [35]:
cur.execute("create table test(x1 INT(5), x2 VARCHAR(20), x3 DATE)")

### mydb.close()

In [36]:
mydb = connection.connect(host="localhost", database = "sudhanshu12345",user="root", passwd="Ineuron@ukc@5",use_pure=True)

In [37]:
cur = mydb.cursor()

In [38]:
cur.execute("insert into test values(23459, 'xyz', '2022-01-31')")

In [39]:
mydb.is_connected()

True

In [40]:
mydb.commit()

In [41]:
cur.execute("insert into test values(23459, 'xyz', '2022-01-31')")

In [42]:
mydb.commit()

In [47]:
cur.execute("insert into test values(23459, 'xyz', '2022-01-31')")
cur.execute("insert into test values(23459, 'xyz', '2022-01-31')")
cur.execute("insert into test values(23459, 'xyz', '2022-01-31')")
cur.execute("insert into test values(23459, 'xyz', '2022-01-31')")
cur.execute("insert into test values(23459, 'xyz', '2022-01-31')")

In [48]:
mydb.commit()

In [49]:
cur.execute("insert into test values(345, 'sdf', '2022-01-31')")
cur.execute("insert into test values(2349, 'sdsf', '2022-01-31')")
cur.execute("insert into test values(68, 'sdf', '2022-01-31')")
cur.execute("insert into test values(6345, 'ui', '2022-01-31')")
cur.execute("insert into test values(45, 'ghhj', '2022-01-31')")

In [50]:
mydb.commit()

In [54]:
mydb = connection.connect(host="localhost", database = 'sudhanshu12345',user="root", passwd="Ineuron@ukc@5",use_pure=True)
    #check if the connection is established
print(mydb.is_connected())
query = "Select * from test;"
cursor = mydb.cursor() #create a cursor to execute queries
cursor.execute(query)
for result in cursor.fetchall():
    print(result)

True
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(23459, 'xyz', datetime.date(2022, 1, 31))
(345, 'sdf', datetime.date(2022, 1, 31))
(2349, 'sdsf', datetime.date(2022, 1, 31))
(68, 'sdf', datetime.date(2022, 1, 31))
(6345, 'ui', datetime.date(2022, 1, 31))
(45, 'ghhj', datetime.date(2022, 1, 31))

In [56]:
cur = mydb.cursor()
cur.execute("select x1, x2 from test")

In [57]:
for result in cur.fetchall():
    print(result)

(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(23459, 'xyz')
(345, 'sdf')
(2349, 'sdsf')
(68, 'sdf')
(6345, 'ui')
(45, 'ghhj')

In [58]:
import pandas as pd

In [59]:
mydb

In [60]:
pd.read_sql("select * from sudhanshu12345.test", mydb)

       x1    x2          x3
0   23459   xyz  2022-01-31
1   23459   xyz  2022-01-31
2   23459   xyz  2022-01-31
3   23459   xyz  2022-01-31
4   23459   xyz  2022-01-31
5   23459   xyz  2022-01-31
6   23459   xyz  2022-01-31
7   23459   xyz  2022-01-31
8   23459   xyz  2022-01-31
9   23459   xyz  2022-01-31
10  23459   xyz  2022-01-31
11  23459   xyz  2022-01-31
12  23459   xyz  2022-01-31
13  23459   xyz  2022-01-31
14  23459   xyz  2022-01-31
15  23459   xyz  2022-01-31
16  23459   xyz  2022-01-31
17  23459   xyz  2022-01-31
18  23459   xyz  2022-01-31
19  23459   xyz  2022-01-31
20  23459   xyz  2022-01-31
21  23459   xyz  2022-01-31
22  23459   xyz  2022-01-31
23  23459   xyz  2022-01-31
24  23459   xyz  2022-01-31
25  23459   xyz  2022-01-31
26  23459   xyz  2022-01-31
27    345   sdf  2022-01-31
28   2349  sdsf  2022-01-31
29     68   sdf  2022-01-31
30   6345    ui  2022-01-31
31     45  ghhj  2022-01-31

In [61]:
pd.read_sql("select x1, x2 from sudhanshu12345.test", mydb)

       x1    x2
0   23459   xyz
1   23459   xyz
2   23459   xyz
3   23459   xyz
4   23459   xyz
5   23459   xyz
6   23459   xyz
7   23459   xyz
8   23459   xyz
9   23459   xyz
10  23459   xyz
11  23459   xyz
12  23459   xyz
13  23459   xyz
14  23459   xyz
15  23459   xyz
16  23459   xyz
17  23459   xyz
18  23459   xyz
19  23459   xyz
20  23459   xyz
21  23459   xyz
22  23459   xyz
23  23459   xyz
24  23459   xyz
25  23459   xyz
26  23459   xyz
27    345   sdf
28   2349  sdsf
29     68   sdf
30   6345    ui
31     45  ghhj

In [62]:
pd.read_sql("select x1, x2 from test", mydb)

       x1    x2
0   23459   xyz
1   23459   xyz
2   23459   xyz
3   23459   xyz
4   23459   xyz
5   23459   xyz
6   23459   xyz
7   23459   xyz
8   23459   xyz
9   23459   xyz
10  23459   xyz
11  23459   xyz
12  23459   xyz
13  23459   xyz
14  23459   xyz
15  23459   xyz
16  23459   xyz
17  23459   xyz
18  23459   xyz
19  23459   xyz
20  23459   xyz
21  23459   xyz
22  23459   xyz
23  23459   xyz
24  23459   xyz
25  23459   xyz
26  23459   xyz
27    345   sdf
28   2349  sdsf
29     68   sdf
30   6345    ui
31     45  ghhj

In [63]:
pd.read_sql("select x1, x1 from test", mydb)

       x1     x1
0   23459  23459
1   23459  23459
2   23459  23459
3   23459  23459
4   23459  23459
5   23459  23459
6   23459  23459
7   23459  23459
8   23459  23459
9   23459  23459
10  23459  23459
11  23459  23459
12  23459  23459
13  23459  23459
14  23459  23459
15  23459  23459
16  23459  23459
17  23459  23459
18  23459  23459
19  23459  23459
20  23459  23459
21  23459  23459
22  23459  23459
23  23459  23459
24  23459  23459
25  23459  23459
26  23459  23459
27    345    345
28   2349   2349
29     68     68
30   6345   6345
31     45     45

In [64]:
pd.read_sql("select x1, x1, x3 from test", mydb)

       x1     x1          x3
0   23459  23459  2022-01-31
1   23459  23459  2022-01-31
2   23459  23459  2022-01-31
3   23459  23459  2022-01-31
4   23459  23459  2022-01-31
5   23459  23459  2022-01-31
6   23459  23459  2022-01-31
7   23459  23459  2022-01-31
8   23459  23459  2022-01-31
9   23459  23459  2022-01-31
10  23459  23459  2022-01-31
11  23459  23459  2022-01-31
12  23459  23459  2022-01-31
13  23459  23459  2022-01-31
14  23459  23459  2022-01-31
15  23459  23459  2022-01-31
16  23459  23459  2022-01-31
17  23459  23459  2022-01-31
18  23459  23459  2022-01-31
19  23459  23459  2022-01-31
20  23459  23459  2022-01-31
21  23459  23459  2022-01-31
22  23459  23459  2022-01-31
23  23459  23459  2022-01-31
24  23459  23459  2022-01-31
25  23459  23459  2022-01-31
26  23459  23459  2022-01-31
27    345    345  2022-01-31
28   2349   2349  2022-01-31
29     68     68  2022-01-31
30   6345   6345  2022-01-31
31     45     45  2022-01-31

In [65]:
pd.read_sql("select x3, x1 from test", mydb)

            x3     x1
0   2022-01-31  23459
1   2022-01-31  23459
2   2022-01-31  23459
3   2022-01-31  23459
4   2022-01-31  23459
5   2022-01-31  23459
6   2022-01-31  23459
7   2022-01-31  23459
8   2022-01-31  23459
9   2022-01-31  23459
10  2022-01-31  23459
11  2022-01-31  23459
12  2022-01-31  23459
13  2022-01-31  23459
14  2022-01-31  23459
15  2022-01-31  23459
16  2022-01-31  23459
17  2022-01-31  23459
18  2022-01-31  23459
19  2022-01-31  23459
20  2022-01-31  23459
21  2022-01-31  23459
22  2022-01-31  23459
23  2022-01-31  23459
24  2022-01-31  23459
25  2022-01-31  23459
26  2022-01-31  23459
27  2022-01-31    345
28  2022-01-31   2349
29  2022-01-31     68
30  2022-01-31   6345
31  2022-01-31     45

In [66]:
a = pd.read_sql("select x3, x1 from test", mydb)

In [67]:
a

            x3     x1
0   2022-01-31  23459
1   2022-01-31  23459
2   2022-01-31  23459
3   2022-01-31  23459
4   2022-01-31  23459
5   2022-01-31  23459
6   2022-01-31  23459
7   2022-01-31  23459
8   2022-01-31  23459
9   2022-01-31  23459
10  2022-01-31  23459
11  2022-01-31  23459
12  2022-01-31  23459
13  2022-01-31  23459
14  2022-01-31  23459
15  2022-01-31  23459
16  2022-01-31  23459
17  2022-01-31  23459
18  2022-01-31  23459
19  2022-01-31  23459
20  2022-01-31  23459
21  2022-01-31  23459
22  2022-01-31  23459
23  2022-01-31  23459
24  2022-01-31  23459
25  2022-01-31  23459
26  2022-01-31  23459
27  2022-01-31    345
28  2022-01-31   2349
29  2022-01-31     68
30  2022-01-31   6345
31  2022-01-31     45

In [68]:
a.to_sql

<bound method NDFrame.to_sql of             x3     x1
0   2022-01-31  23459
1   2022-01-31  23459
2   2022-01-31  23459
3   2022-01-31  23459
4   2022-01-31  23459
5   2022-01-31  23459
6   2022-01-31  23459
7   2022-01-31  23459
8   2022-01-31  23459
9   2022-01-31  23459
10  2022-01-31  23459
11  2022-01-31  23459
12  2022-01-31  23459
13  2022-01-31  23459
14  2022-01-31  23459
15  2022-01-31  23459
16  2022-01-31  23459
17  2022-01-31  23459
18  2022-01-31  23459
19  2022-01-31  23459
20  2022-01-31  23459
21  2022-01-31  23459
22  2022-01-31  23459
23  2022-01-31  23459
24  2022-01-31  23459
25  2022-01-31  23459
26  2022-01-31  23459
27  2022-01-31    345
28  2022-01-31   2349
29  2022-01-31     68
30  2022-01-31   6345
31  2022-01-31     45>

In [69]:
a.to_html

<bound method DataFrame.to_html of             x3     x1
0   2022-01-31  23459
1   2022-01-31  23459
2   2022-01-31  23459
3   2022-01-31  23459
4   2022-01-31  23459
5   2022-01-31  23459
6   2022-01-31  23459
7   2022-01-31  23459
8   2022-01-31  23459
9   2022-01-31  23459
10  2022-01-31  23459
11  2022-01-31  23459
12  2022-01-31  23459
13  2022-01-31  23459
14  2022-01-31  23459
15  2022-01-31  23459
16  2022-01-31  23459
17  2022-01-31  23459
18  2022-01-31  23459
19  2022-01-31  23459
20  2022-01-31  23459
21  2022-01-31  23459
22  2022-01-31  23459
23  2022-01-31  23459
24  2022-01-31  23459
25  2022-01-31  23459
26  2022-01-31  23459
27  2022-01-31    345
28  2022-01-31   2349
29  2022-01-31     68
30  2022-01-31   6345
31  2022-01-31     45>

In [70]:
a.to_csv("mydata.csv")

In [71]:
mydb

In [72]:
cur = mydb.cursor()

cur.execute("create table mydata(n1 int(20), n2 varchar(20), n3 date)")

In [73]:
data_to_be_inserted = pd.read_csv("mydata.csv")

In [74]:
data_to_be_inserted.to_sql('mydata', mydb)

C:\Users\Utkarsh\anaconda3\lib\site-packages\pandas\core\generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

In [81]:
data1 = pd.read_sql("select * from test", mydb)

In [82]:
data1.to_html()

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>x1</th>\n      <th>x2</th>\n      <th>x3</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>6</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>7</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>8</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>9</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>10</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>11</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>12</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>13</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>14</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>15</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>16</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>17</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>18</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>19</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>20</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>21</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>22</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>23</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>24</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>25</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>26</th>\n      <td>23459</td>\n      <td>xyz</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>27</th>\n      <td>345</td>\n      <td>sdf</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>28</th>\n      <td>2349</td>\n      <td>sdsf</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>29</th>\n      <td>68</td>\n      <td>sdf</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>30</th>\n      <td>6345</td>\n      <td>ui</td>\n      <td>2022-01-31</td>\n    </tr>\n    <tr>\n      <th>31</th>\n      <td>45</td>\n      <td>ghhj</td>\n      <td>2022-01-31</td>\n    </tr>\n  </tbody>\n</table>'

In [85]:
data1.to_csv("mydata1.csv")

In [86]:
cur = mydb.cursor()

cur.execute("create table mydata1(n1 int(20), n2 varchar(20), n3 date)")

ProgrammingError: 1050 (42S01): Table 'mydata1' already exists

In [79]:
data_to_be_dumped = pd.read_csv("mydata1.csv")

In [80]:
data_to_be_dumped.to_sql('mydata1', mydb)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

>>> from sqlalchemy import create_engine
>>> engine = create_engine('sqlite://', echo=False)

Create a table from scratch with 3 rows.

>>> df = pd.DataFrame({'name' : ['User 1', 'User 2', 'User 3']})
>>> df
     name
0  User 1
1  User 2
2  User 3

>>> df.to_sql('users', con=engine)
>>> engine.execute("SELECT * FROM users").fetchall()
[(0, 'User 1'), (1, 'User 2'), (2, 'User 3')]

An `sqlalchemy.engine.Connection` can also be passed to `con`:

>>> with engine.begin() as connection:
...     df1 = pd.DataFrame({'name' : ['User 4', 'User 5']})
...     df1.to_sql('users', con=connection, if_exists='append')

This is allowed to support operations that require that the same
DBAPI connection is used for the entire operation.

>>> df2 = pd.DataFrame({'name' : ['User 6', 'User 7']})
>>> df2.to_sql('users', con=engine, if_exists='append')
>>> engine.execute("SELECT * FROM users").fetchall()
[(0, 'User 1'), (1, 'User 2'), (2, 'User 3'),
 (0, 'User 4'), (1, 'User 5'), (0, 'User 6'),
 (1, 'User 7')]

Overwrite the table with just ``df2``.

>>> df2.to_sql('users', con=engine, if_exists='replace',
...            index_label='id')
>>> engine.execute("SELECT * FROM users").fetchall()
[(0, 'User 6'), (1, 'User 7')]

Specify the dtype (especially useful for integers with missing values).
Notice that while pandas is forced to store the data as floating point,
the database supports nullable integers. When fetching the data with
Python, we get back integer scalars.

>>> df = pd.DataFrame({"A": [1, None, 2]})
>>> df
     A
0  1.0
1  NaN
2  2.0

>>> from sqlalchemy.types import Integer
>>> df.to_sql('integers', con=engine, index=False,
...           dtype={"A": Integer()})

>>> engine.execute("SELECT * FROM integers").fetchall()

In [87]:
import mysql.connector as connection
import pandas as pd
import csv
mydb = connection.connect(host="localhost", user ="root", passwd = "Ineuron@ukc@5", use_pure= True)

In [94]:
cur = mydb.cursor()

cur.execute("create table if not exists sudhanshu12345.glass(Index_Number int(10),RI float(10,5), Na float(10,5), Mg float(10,5),Al float(10,5), Si float(10,5), K float(10,5), Ca float(10,5), Ba float(10,5), Fe float(10,5), Class int(5))")
# we have given here databasename.tablename, because while creating the connection, we have not defined database name there

In [95]:
!ls

'ls' is not recognized as an internal or external command,
operable program or batch file.

In [99]:
%ls

 Volume in drive C is Windows
 Volume Serial Number is C21A-2381

 Directory of C:\Users\Utkarsh\Classes\Fast Track Mode\Databases Lecture

01-02-2022  07:18    <DIR>          .
01-02-2022  07:18    <DIR>          ..
31-01-2022  11:54    <DIR>          .ipynb_checkpoints
01-02-2022  07:18               915 filecontainingdataToBeDumped.data
31-01-2022  20:30               652 mydata.csv
31-01-2022  20:45               792 mydata1.csv
31-01-2022  21:58           131,047 recorded DataBases jan 31 2022_ SQL_Basic.ipynb
               4 File(s)        133,406 bytes
               3 Dir(s)  110,612,865,024 bytes free

In [100]:
import os
os.listdir()

['.ipynb_checkpoints',
 'filecontainingdataToBeDumped.data',
 'mydata.csv',
 'mydata1.csv',
 'recorded DataBases jan 31 2022_ SQL_Basic.ipynb']

with open('filecontainingdataToBeDumped.data',"r") as data :
    next(data)
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    print(data_csv)
    for i in enumerate(data_csv):
        print(i)
        for j in i[1] :
            print(type(j))
            cur.execute('insert into sudhanshu12345.glass values ({data})'.format(data=(j)))
    print("all the data inserted ")
mydb.commit()

In [101]:
with open('filecontainingdataToBeDumped.data',"r") as data :
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    print(data_csv)

<_csv.reader object at 0x000002AAD775A4C0>

In [103]:
with open('filecontainingdataToBeDumped.data',"r") as data :
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    print(data_csv)
    for i in data_csv:
        print(i)

<_csv.reader object at 0x000002AAD5CE1400>
['Index_Number,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe,Class']
['1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.00,0.00,1']
['2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.00,0.00,1']
['3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.00,0.00,1']
['4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.00,0.00,1']
['5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.00,0.00,1']
['6,1.51596,12.79,3.61,1.62,72.97,0.64,8.07,0.00,0.26,1']
['7,1.51743,13.30,3.60,1.14,73.09,0.58,8.17,0.00,0.00,1']
['8,1.51756,13.15,3.61,1.05,73.24,0.57,8.24,0.00,0.00,1']
['9,1.51918,14.04,3.58,1.37,72.08,0.56,8.30,0.00,0.00,1']
['10,1.51755,13.00,3.60,1.36,72.99,0.57,8.40,0.00,0.11,1']
['11,1.51571,12.72,3.46,1.56,73.20,0.67,8.09,0.00,0.24,1']
['12,1.51763,12.80,3.66,1.27,73.01,0.60,8.56,0.00,0.00,1']
['13,1.51589,12.88,3.43,1.40,73.28,0.69,8.05,0.00,0.24,1']
['14,1.51748,12.86,3.56,1.27,73.21,0.54,8.38,0.00,0.17,1']
['15,1.51763,12.61,3.59,1.31,73.29,0.58,8.50,0.00,0.00,1']
['16,1.51761,12.81,3.54,1.23,73.24,0.58,8.39,0.00,0.00,1']

In [104]:
with open('filecontainingdataToBeDumped.data',"r") as data :
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    print(data_csv)
    for i in enumerate(data_csv):
        print(i)

<_csv.reader object at 0x000002AAD5A52160>
(0, ['Index_Number,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe,Class'])
(1, ['1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.00,0.00,1'])
(2, ['2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.00,0.00,1'])
(3, ['3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.00,0.00,1'])
(4, ['4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.00,0.00,1'])
(5, ['5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.00,0.00,1'])
(6, ['6,1.51596,12.79,3.61,1.62,72.97,0.64,8.07,0.00,0.26,1'])
(7, ['7,1.51743,13.30,3.60,1.14,73.09,0.58,8.17,0.00,0.00,1'])
(8, ['8,1.51756,13.15,3.61,1.05,73.24,0.57,8.24,0.00,0.00,1'])
(9, ['9,1.51918,14.04,3.58,1.37,72.08,0.56,8.30,0.00,0.00,1'])
(10, ['10,1.51755,13.00,3.60,1.36,72.99,0.57,8.40,0.00,0.11,1'])
(11, ['11,1.51571,12.72,3.46,1.56,73.20,0.67,8.09,0.00,0.24,1'])
(12, ['12,1.51763,12.80,3.66,1.27,73.01,0.60,8.56,0.00,0.00,1'])
(13, ['13,1.51589,12.88,3.43,1.40,73.28,0.69,8.05,0.00,0.24,1'])
(14, ['14,1.51748,12.86,3.56,1.27,73.21,0.54,8.38,0.00,0.17,1'])
(15, ['15,1.51763,12.61,3.59,1.31,73.29,0.58,8.50,0.00,0.00,1'])
(16, ['16,1.51761,12.81,3.54,1.23,73.24,0.58,8.39,0.00,0.00,1'])

In [106]:
with open('filecontainingdataToBeDumped.data',"r") as data :
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    print(data_csv)
    for i in enumerate(data_csv):
        print(i)
        for j in i[1] :#i[1] because we want the data present in the list to be dumped...and the list is index 1 of the tuple
            cur.execute('insert into sudhanshu12345.glass values ({data})'.format(data=(j))) #using format placeholder
    print("All the data inserted")        
mydb.commit()

<_csv.reader object at 0x000002AAD775A4C0>
(0, ['Index_Number,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe,Class'])
(1, ['1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.00,0.00,1'])
(2, ['2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.00,0.00,1'])
(3, ['3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.00,0.00,1'])
(4, ['4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.00,0.00,1'])
(5, ['5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.00,0.00,1'])
(6, ['6,1.51596,12.79,3.61,1.62,72.97,0.64,8.07,0.00,0.26,1'])
(7, ['7,1.51743,13.30,3.60,1.14,73.09,0.58,8.17,0.00,0.00,1'])
(8, ['8,1.51756,13.15,3.61,1.05,73.24,0.57,8.24,0.00,0.00,1'])
(9, ['9,1.51918,14.04,3.58,1.37,72.08,0.56,8.30,0.00,0.00,1'])
(10, ['10,1.51755,13.00,3.60,1.36,72.99,0.57,8.40,0.00,0.11,1'])
(11, ['11,1.51571,12.72,3.46,1.56,73.20,0.67,8.09,0.00,0.24,1'])
(12, ['12,1.51763,12.80,3.66,1.27,73.01,0.60,8.56,0.00,0.00,1'])
(13, ['13,1.51589,12.88,3.43,1.40,73.28,0.69,8.05,0.00,0.24,1'])
(14, ['14,1.51748,12.86,3.56,1.27,73.21,0.54,8.38,0.00,0.17,1'])
(15, ['15,1.51763,12.61,3.59,1.31,73.29,0.58,8.50,0.00,0.00,1'])
(16, ['16,1.51761,12.81,3.54,1.23,73.24,0.58,8.39,0.00,0.00,1'])
All the data inserted

##### we are getting NULL in the 1st row of the table in mySQL workbench because we are trying to insert indexnumber ,,,RI, Na,Mg,,,,,unnecessarily as there is already a row for all these things in the table of mySQL workbench

##### therefore we will use next function to start from the next line

In [108]:
with open('filecontainingdataToBeDumped.data',"r") as data :
    next(data)
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    print(data_csv)
    for i in enumerate(data_csv):
        print(i)
        for j in i[1] :#i[1] because we want the data present in the list to be dumped...and the list is index 1 of the tuple
            cur.execute('insert into sudhanshu12345.glass values ({data})'.format(data=(j))) #using format placeholder
    print("All the data inserted")        
mydb.commit()

<_csv.reader object at 0x000002AAD5DB8700>
(0, ['1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.00,0.00,1'])
(1, ['2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.00,0.00,1'])
(2, ['3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.00,0.00,1'])
(3, ['4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.00,0.00,1'])
(4, ['5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.00,0.00,1'])
(5, ['6,1.51596,12.79,3.61,1.62,72.97,0.64,8.07,0.00,0.26,1'])
(6, ['7,1.51743,13.30,3.60,1.14,73.09,0.58,8.17,0.00,0.00,1'])
(7, ['8,1.51756,13.15,3.61,1.05,73.24,0.57,8.24,0.00,0.00,1'])
(8, ['9,1.51918,14.04,3.58,1.37,72.08,0.56,8.30,0.00,0.00,1'])
(9, ['10,1.51755,13.00,3.60,1.36,72.99,0.57,8.40,0.00,0.11,1'])
(10, ['11,1.51571,12.72,3.46,1.56,73.20,0.67,8.09,0.00,0.24,1'])
(11, ['12,1.51763,12.80,3.66,1.27,73.01,0.60,8.56,0.00,0.00,1'])
(12, ['13,1.51589,12.88,3.43,1.40,73.28,0.69,8.05,0.00,0.24,1'])
(13, ['14,1.51748,12.86,3.56,1.27,73.21,0.54,8.38,0.00,0.17,1'])
(14, ['15,1.51763,12.61,3.59,1.31,73.29,0.58,8.50,0.00,0.00,1'])
(15, ['16,1.51761,12.81,3.54,1.23,73.24,0.58,8.39,0.00,0.00,1'])
All the data inserted

In [109]:
with open('filecontainingdataToBeDumped.data',"r") as data :
    next(data)
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    print(data_csv)
    for i in data_csv:
        print(i)
        cur.execute('insert into sudhanshu12345.glass values ({data})'.format(data=str(i[0]))) #using format placeholder
    print("All the data inserted")        
mydb.commit()

<_csv.reader object at 0x000002AAD775A4C0>
['1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.00,0.00,1']
['2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.00,0.00,1']
['3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.00,0.00,1']
['4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.00,0.00,1']
['5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.00,0.00,1']
['6,1.51596,12.79,3.61,1.62,72.97,0.64,8.07,0.00,0.26,1']
['7,1.51743,13.30,3.60,1.14,73.09,0.58,8.17,0.00,0.00,1']
['8,1.51756,13.15,3.61,1.05,73.24,0.57,8.24,0.00,0.00,1']
['9,1.51918,14.04,3.58,1.37,72.08,0.56,8.30,0.00,0.00,1']
['10,1.51755,13.00,3.60,1.36,72.99,0.57,8.40,0.00,0.11,1']
['11,1.51571,12.72,3.46,1.56,73.20,0.67,8.09,0.00,0.24,1']
['12,1.51763,12.80,3.66,1.27,73.01,0.60,8.56,0.00,0.00,1']
['13,1.51589,12.88,3.43,1.40,73.28,0.69,8.05,0.00,0.24,1']
['14,1.51748,12.86,3.56,1.27,73.21,0.54,8.38,0.00,0.17,1']
['15,1.51763,12.61,3.59,1.31,73.29,0.58,8.50,0.00,0.00,1']
['16,1.51761,12.81,3.54,1.23,73.24,0.58,8.39,0.00,0.00,1']
All the data inserted

In [168]:
cur = mydb.cursor()

query = """insert into sudhanshu12345.glass(Index_Number ,RI, Na , Mg ,Al, Si , K , Ca , Ba , Fe , Class ) values(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)"""


with open('filecontainingdataToBeDumped.data',"r") as data :
    next(data)
    data_csv = csv.reader(data, delimiter= "\n") # converting filecontainingdataToBeDumped.data to csv
    listt=[]
    for i in data_csv:
        store = i[0].split(",")
        new_store = tuple(store)
        listt.append(new_store)
    print(listt)
    cur.executemany(query,listt) #withouusing format placeholder
    print("All the data inserted")        
mydb.commit()

[('1', '1.52101', '13.64', '4.49', '1.10', '71.78', '0.06', '8.75', '0.00', '0.00', '1'), ('2', '1.51761', '13.89', '3.60', '1.36', '72.73', '0.48', '7.83', '0.00', '0.00', '1'), ('3', '1.51618', '13.53', '3.55', '1.54', '72.99', '0.39', '7.78', '0.00', '0.00', '1'), ('4', '1.51766', '13.21', '3.69', '1.29', '72.61', '0.57', '8.22', '0.00', '0.00', '1'), ('5', '1.51742', '13.27', '3.62', '1.24', '73.08', '0.55', '8.07', '0.00', '0.00', '1'), ('6', '1.51596', '12.79', '3.61', '1.62', '72.97', '0.64', '8.07', '0.00', '0.26', '1'), ('7', '1.51743', '13.30', '3.60', '1.14', '73.09', '0.58', '8.17', '0.00', '0.00', '1'), ('8', '1.51756', '13.15', '3.61', '1.05', '73.24', '0.57', '8.24', '0.00', '0.00', '1'), ('9', '1.51918', '14.04', '3.58', '1.37', '72.08', '0.56', '8.30', '0.00', '0.00', '1'), ('10', '1.51755', '13.00', '3.60', '1.36', '72.99', '0.57', '8.40', '0.00', '0.11', '1'), ('11', '1.51571', '12.72', '3.46', '1.56', '73.20', '0.67', '8.09', '0.00', '0.24', '1'), ('12', '1.51763', '12.80', '3.66', '1.27', '73.01', '0.60', '8.56', '0.00', '0.00', '1'), ('13', '1.51589', '12.88', '3.43', '1.40', '73.28', '0.69', '8.05', '0.00', '0.24', '1'), ('14', '1.51748', '12.86', '3.56', '1.27', '73.21', '0.54', '8.38', '0.00', '0.17', '1'), ('15', '1.51763', '12.61', '3.59', '1.31', '73.29', '0.58', '8.50', '0.00', '0.00', '1'), ('16', '1.51761', '12.81', '3.54', '1.23', '73.24', '0.58', '8.39', '0.00', '0.00', '1')]
All the data inserted